Revit 2027 API
Family.IsEditable Property
 True if the family supports editing, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEditable { get; }
Public ReadOnly Property IsEditable As Boolean
	Get
public:
property bool IsEditable {
	bool get ();
}
member IsEditable : bool with get
Property Value
Boolean
Remarks
 The family will not be editable if it is in-place, not saveable, or represents the primary family inside a family document.
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace